# 1. Найти сумму чисел списка стоящих на нечетной позиции
# Пример:[1,2,3,4] -> 4

# num=[1,2,3,4]
# summa=0
# for i in range(0,len(num), 2):
#     summa+=num[i]
# print("Cумма чисел списка стоящих на нечетной позиции = ", summa)    

# 2. Найти произведение пар чисел в списке. Парой считаем первый и последний элемент, второй и предпоследний и т.д. 
# Пример: [2, 3, 4, 5, 6] => [12, 15, 16]; [2, 3, 5, 6] => [12, 15] 

# num = [2, 3, 4, 5, 6]
# pow = []
# i = 0
# for j in range (len(num)-1,(len(num)//2)-1,-1):
#     pow.append(num[i]*num[j])
#     i+=1    
# print(pow)

# 3. В заданном списке вещественных чисел найдите разницу между максимальным и минимальным значением дробной части элементов. 
# Пример: [1.1, 1.2, 3.1, 5, 10.01] => 0.19

# num = [1.1, 1.2, 3.1, 5, 10.01]
# num_after_point = []
# for i in num:
#   if i%1 != 0:
#     num_after_point.append(i%1) 
# print('%.2f' % (max(num_after_point) - min(num_after_point)))

# 4.	Написать программу преобразования десятичного числа в двоичное

n = int(input('Введите число: '))
def conv_dec_to_bin(n):
    bin_num = ''
    while n > 1:
        bin_num += str(n % 2)
        n = n // 2
    return bin_num[::-1]
print(conv_dec_to_bin(n))


